package typeMenu

import "fmt"

func CircleMenu() {
	fmt.Println("╭───────────────────────────────────────────────────────────╮")
	fmt.Println("│           Выберите действие ⇓                             │")
	fmt.Println("├───────────────────────────────────────────────────────────┤")
	fmt.Println("│           1. ⇒ Ввести новые данные в слайс                │")
	fmt.Println("├───────────────────────────────────────────────────────────┤")
	fmt.Println("│           2. ⇒ Создать новый слайс                        │")
	fmt.Println("├───────────────────────────────────────────────────────────┤")
	fmt.Println("│           3. ⇒ Получить все слайсы                        │")
	fmt.Println("├───────────────────────────────────────────────────────────┤")
	fmt.Println("│           4. ⇒ Удалить слайс                              │")
	fmt.Println("├───────────────────────────────────────────────────────────┤")
	fmt.Println("│           5. ⇒ Слияния слайсов (Объединение)              │")
	fmt.Println("├───────────────────────────────────────────────────────────┤")
	fmt.Println("│           6. ⇒ Отсортировать слайс                        │")
	fmt.Println("├───────────────────────────────────────────────────────────┤")
	fmt.Println("│           7. ⇒ Циклический сдвиг слайса                   │")
	fmt.Println("├───────────────────────────────────────────────────────────┤")
	fmt.Println("│           8. ⇒ Сделать новый вид меню                     │")
	fmt.Println("├───────────────────────────────────────────────────────────┤")
	fmt.Println("│           9. ⇒ Обо мне                                    │")
	fmt.Println("├───────────────────────────────────────────────────────────┤")
	fmt.Println("│           0. ⇒ Выход                                      │")
	fmt.Println("╰───────────────────────────────────────────────────────────╯")
}
